app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-12-06 06:05:00.080778"], ["updated_at", "2015-12-06 06:05:00.080778"]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save