app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])

    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 207281424]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-12-06 06:05:00.712918"], ["updated_at", "2015-12-06 06:05:00.712918"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 207281424], ["cart_id", 980190969], ["created_at", "2015-12-06 06:05:00.717906"], ["updated_at", "2015-12-06 06:05:00.717906"]]