app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-12-06 06:05:00.425626"], ["updated_at", "2015-12-06 06:05:00.425626"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Dave Thomas"], ["address", "MyText"], ["email", "dave@example.org"], ["pay_type", "Check"], ["created_at", "2015-12-06 06:05:00.428629"], ["updated_at", "2015-12-06 06:05:00.428629"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]