app/controllers/products_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all.map{|c| [ c.name, c.id ] }

INSERT INTO "products" ("title", "description", "image_url", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save

UPDATE "products" SET "category_id" = ?, "title" = ?, "description" = ?, "image_url" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category_id", nil], ["title", "Lorem Ipsum"], ["description", "Wibbles are fun"], ["image_url", "lorem.jpg"], ["price", 19.95], ["updated_at", "2015-11-30 03:39:12.064188"], ["id", 980190962]]
---
  def update
    @product.category_id = params[:category_id]
    respond_to do |format|
      if @product.update(product_params)