app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sam"], ["password_digest", "$2a$04$VvuwibHBzz9Ppyh2djmCreZY5YMyWe6VWZmwzcLz.CJI5wTH9V6k2"], ["created_at", "2015-12-06 06:05:00.849096"], ["updated_at", "2015-12-06 06:05:00.849096"]]