app/views/categories/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", "980190962"]]
---
  <div class="row">
   <% Product.where(category_id: @category.id).each do |product| %>