app/views/products/_form.html.erb

  <div class="form-group">
  <%= collection_select(:product, :category_id, Category.all, :id, :name, :prompt => "Select one!", class: 'form-control') %>
---
SELECT "categories".* FROM "categories"