app/views/products/index.html.erb

        <td><%= product.price %></td>
        <td><%= Category.find(product.category_id).name %></td>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 0]]